using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace RGM
{
    public class Tips
    {
        public static List<string> LobbyTips { get; set; } = new List<string>()
        {
            "꺼진 모드도 다시 보라. 어느 순간 개편되어 있을 수 있다.", 
            "<b>워크스테이션 업그레이드</b> 모드는 초기에 \"능력자 대전\" 형식으로 기획되었다.",
            "가끔씩 서버의 유저들이 멈춘 것 같다면, 해결될때까지 나갔다 들어와보라.", 
            "디스코드에서 실시간 패치 내용을 확인할 수 있다.",
            "모드를 이해하기 어렵다면 콘솔(` 또는 ~)을 열어 자세한 설명을 확인해라.", 
            "랜겜모 리부트 서버는 9월 3일부터 개발이 시작되었다.",
            "랜겜모 리부트 서버는 9월 6일에 v1.0.0 버전이 완성되었지만, 내부 사정으로 9월 8일부터 테스트 서버를 열었다.", 
            "하루가 지날 때마다 무언가 변경되는 사항이 눈에 띌 것이다.", 
            "버그라고 판단되는 사항이 있다면 가장 먼저 디스코드에 제보해라.",
            "[.문의] 명령어를 사용하여 서버 내에서 곧바로 관리자에게 명령어를 전달할 수 있다.", 
            "자신에게 버그가 일어났을 경우, [.자살] 명령어를 사용하여 일시적으로 해결할 수 있다.",
            "채팅 명령어(.ㅊ 또는 .c)는 근거리/관전자/SCP 기능이 존재한다.", 
            "근거리 채팅 기능의 경우, 관전자에게도 동일하게 보인다. SCP 채팅은 관전자에게 보이지 않는다.",
            "<b>소울메이트</b> 모드는 개발자와 서버와 유저를 가장 많이 괴롭힌 모드이다.", 
            "가끔씩 서버 내에 이스터에그가 숨겨져 있다. 찾으면 기분이 좋아질 것이다.",
            "이전 로비(v2.0~2.1) 바깥에 있는 맵은 Roblox의 Prison LIfe라는 게임의 맵을 구현한 것이다.", 
            "존버는 되도록이면 하지 말자. 게임을 질질 끌어 모두를 재미없게 만든다.",
            "자동핵은 20분에 작동되며, 끌 수 없다. 시간을 잘 보는 것도 전략이 될 것이다.", 
            "이 서버는 계속해서 개발되는 서버이다. 따라서 불안정해지기 쉽다.",
            "서버 개발자는 규정을 순간적으로 망각하여 제재를 당할 뻔 했다. 여러분도 조심해서 나쁠 건 없을 것이다.", 
            "선택 모드가 가끔씩 평소와 달라질 때가 있다.",
            "대부분 [.모드] 명령어의 추가 기능에 대해서 모른다. [.모드 (모드 이름)] 명령어를 통해 특정 모드의 설명을 불러올 수 있다.", 
            "<s>당신들은 귀엽게 생겼어.</s>",
            "모른다고 말하는 것은 죄가 아니다, 죄란 아는 척 하는 것이다."
        };
    }
}
